Repository: HelloYeew/osu-ruleset-pages
Catalog: rurusetto/wiki/locale/*/LC_MESSAGES/django.po
Languages: fr, th

source: Back to recommend beatmaps
fr: Revenir au beatmaps recommandées
th: กลับไปที่บีทแมปแนะนำ

# already_approve_all_beatmaps
source: You are already response to all beatmaps.
fr: Vous êtes déjà approuvés pour toutes les beatmaps
th: คุณได้ตอบกลับบีทแมปทุกอันแล้ว

source: Congrats!
fr: Félicitations !
th: ยินดีด้วย!

source: by
fr: par
th: โดย

source: ranked
fr: classée
th: จัดอันดับแล้ว

source: pending
fr: en attente
th: รอดำเนินการ

source: graveyard
fr: cimetière
th: สุสาน

source: mapped by
fr: mappé par
th: แมพโดย

source: Recommend by
fr: Recommandé par
th: แนะนำโดย

source: Approve
fr: Approuver
th: อนุมัติ

source: Deny
fr: Rejeter
th: ปฏิเสธ

# status_description
source: Status of all rulesets are here. (and you can download and update the rulesets instantly with this page!)
fr: Les status de tous les rulesets sont ici. (et vous pouvez télécharger et mettre à jour les rulesets instantanément avec cette page !)
th: สถานะของ rulesets ทุกอันอยู่ที่นี่ (และคุณสามารถดาวน์โหลดและอัพเดท rulesets อย่างรวดเร็วได้ด้วยหน้านี้!)

source: borked
fr: cassé
th: เล่นไม่ได้

source: unknown
fr: inconnu
th: ไม่ทราบ

# mark_as_archived
source: This ruleset is marked as archived and no longer update by the creator.
fr: Ce ruleset est marqué comme archivé et n'est plus mis à jour par son créateur.
th: ruleset อันนี้ถูกตั้งว่าถูกเก็บแล้วและไม้ได้รับการอัพเดทโดยผู้สร้างอีก

source: Latest version name
fr: Nom de la dernière version
th: ชื่อเวอร์ชั่นล่าสุด

source: Latest release
fr: Dernière version
th: ปล่อยล่าสุด

source: File Detail
fr: Détails du fichier
th: ข้อมูลไฟล์

source: Size
fr: Taille
th: ขนาด

source: Latest Version Changelog
fr: Journal de modifications de la dernière version
th: ประวิติการอัพเดทของเวอร์ชั่นล่าสุด

source: Download latest version
fr: Télécharger la dernière version
th: ดาวน์โหลดเวอร์ชั่นล่าสุด

# not_support_pre_release_ruleset
source: We are not support direct download for pre-release rulesets from GitHub now. Please get it from ruleset release page instead.
fr: Nous ne supportons pas le téléchargement direct des pré-versions de rulesets depuis GitHub. Veuillez le récupérer depuis la page des versions du ruleset.
th: เรายังไม่รับรองการดาวร์โหลดโดยตรงสำหรับ ruleset ที่ pre-release มาจาก GitHub กรุณาไปโหลดในหน้า release ของ GitHub แทน

source: Download localisation file
th: ดาวน์โหลดไฟล์ภาษา

# support_localisation_no_filename
source: This ruleset is support localisation but no filename provided on our database, you can download it from GitHub release page.
th: Ruleset นี้รองรับการใช้งานหลายภาษาแต่ไม่มีชื่อไฟล์ภาษาในฐานข้อมูลของเรา คุณสามารถดาวน์โหลดมันได้จากหน้า release ของ GitHub

source: GitHub release page
fr: Page des versions GitHub
th: หน้า release ของ GitHub

source: Go to rulesets wiki page
fr: Aller à la page wiki du ruleset
th: ไปที่หน้าวิกิของ rulesets

source: Function is not available due to the rulesets source is from GitHub and <code>Ruleset Filename</code> field is missing or blank. Please fill the <code>Ruleset Filename</code> in the rulesets setting!
fr: Cette fonctionnalité n'est pas disponible car la source du ruleset est GitHub et le champ <code>Nom du ruleset</code> est manquant ou vide. Veuillez remplir le <code>Nom du ruleset</code> dans les paramètres du ruleset !
th: ฟังก์ชั่นไม่พร้อมใช้งานเนื่องจากที่มาของ rulesets มาจาก GitHub และช่อง <code>ชื่อไฟล์ Ruleset</code> ถูกปล่อยว่าง กรุณาไปใส่ <code>ชื่อไฟล์ Ruleset</code> ในการตั้งต่า rulesets ด้วย

source: This function is not support in rulesets that is from Patreon. You can go to rulesets creator's Patreon at <code>Get from Patreon</code>!
fr: Cette fonctionnalité n'est pas supportée par les rulesets provenant de Patreon. Vous pouvez accéder au Patreon du créateur du ruleset à <code>Obtenir depuis Patreon</code> !
th: ฟังก์ชั่นนี้ไม่รองรับ rulesets ที่มาจาก Patreon คุณสามารถไปที่หน้า Patreon ของผู้สร้างได้ที่ <code>Get from Patreon</code>!

source: Get from Patreon
fr: Obtenir depuis Patreon
th: รับจาก Patreon

source: Rūrusetto-chan don't know this link's type so you can download the ruleset from its source.
fr: Rūrusetto-chan ne connaît pas ce type de lien donc vous pouvez télécharger le ruleset depuis sa source.
th: น้อน Rūrusetto ไม่รู้ชนิดของลิงก์นี้ฉะนั้นคุณสามารถดาวน์โหลด ruleset นี้ได้จากที่มาของ ruleset นี้ได้เลย

source: Ruleset source
fr: Source du ruleset
th: ที่มาของ ruleset

source: Edit this subpage
fr: Modifier cette sous-page
th: แก้ไขหน้าย่อยนี้

source: Last edited by
fr: Modifié pour la dernière fois par
th: แก้ไขล่าสุดโดย

source: at
fr: le
th: เมื่อ

source: Edit rulesets info
fr: Modifier les information des rulesets
th: แก้ไขข้อมูล rulesets

source: Add new subpage
fr: Ajouter une nouvelle sous-page
th: เพิ่มหน้าย่อยใหม่

source: Recommend beatmaps
fr: Beatmaps recommandées
th: บีทแมปแนะนำ

# localisation_support
source: This ruleset support localisation function! See more info on how to setup <a href='/install/localization'>here</a>.
th: Ruleset นี้รองรับการใช้งานหลายภาษา สามารถศึกษาต้อเกี่ยวกับฟังก์ชั่นนี้ได้<a href='#'>ที่นี่</a>.

source: Subpage Index
fr: Index de la sous-page
th: สารบัญหน้าย่อย

source: Creator
fr: Créateur
th: ผู้สร้าง

source: Support the creator
fr: Supporter le créateur
th: สนับสนุนผู้สร้าง

source: Support
fr: Supporter
th: สนับสนุน

source: Message from
fr: Message de
th: ข้อความจาก

source: Buy a coffee
fr: Acheter un café
th: ซื้อกาแฟให้

source: home
th: หน้าหลัก

source: Ruleset name %(name)s has added to the list!
th: Ruleset ชื่อ %(name)s ถูกเพิ่มเข้ารายการแล้ว!

source: Subpage "%(title)s" for %(name)s has been created!
th: หน้าย่อย "%(title)s" สำหรับ %(name)s ถูกสร้างขึ้นแล้ว!

source: Edit subpage successfully!
th: แก้ไขหน้าย่อยสำเร็จ!

source: Delete subpage successfully!
th: ลบหน้าย่อยสำเร็จ!

source: You don't have permission to do this!
th: คุณไม่มีสิทธิ์ทำสิ่งนี้!

source: Added %(title)s [%(version)s] as a recommended beatmap successfully!
th: เพิ่ม %(title)s [%(version)s] เป็นบีทแมพแนะนำสำเร็จแล้ว!

source: Added %(title)s [%(version)s] to a waiting list! Please wait for the ruleset owner to approve your beatmap!
th: เพิ่ม %(title)s [%(version)s] เข้ารายการรออนุมัติแล้ว! กรุณารอเจ้าของ ruleset เข้ามาอนุมัติบีทแมพนะ!

source: Adding beatmap failed! (Cannot connect to osu! API)
th: เพิ่มบีทแมพไม่สำเร็จ (เชื่อมต่อ osu! API ไม่สำเร็จ)

source: Adding beatmap failed! (Beatmap ID not found in osu! mode.)
th: เพิ่มบีทแมพไม่สำเร็จ (ไม่พบบีทแมพไอดีนี้ในโหมด osu!)

source: Adding beatmap failed! (You are already recommend this beatmap.)
th: เพิ่มบีทแมพไม่สำเร็จ (คุณแนะนำบีทแมพนี้ไปแล้ว)

source: Adding beatmap failed! (This beatmap is already recommended by other user in this ruleset.)
th: เพิ่มบีทแมพไม่สำเร็จ (บีทแมพนี้ถูกแนะนำโดยผู้เล่นอื่นใน ruleset นี้แล้ว)

source: Adding beatmap failed! (Unknown error.)
th: เพิ่มบีทแมพไม่สำเร็จ (ไม่ทราบข้อผิดพลาด)

source: You already qualified this beatmap!
th: คุณได้คัดเลือกบีทแมพนี้ไปแล้ว!

source: Approve beatmap successfully!
th: อนุมัติบีทแมพสำเร็จ!

source: Deny beatmap successfully!
th: ปฏิเสธบีทแมพสำเร็จ!

source: pre-release
fr: Pas encore publié

source: Ex. From <a href="https://github.com/naoei/tau">tau</a> : osu.Game.Rulesets.Tau.dll and the link will render as <a href="https://github.com/naoei/tau/releases/latest/download/osu.Game.Rulesets.Tau.dll">https://github.com/naoei/tau/releases/latest/download/osu.Game.Rulesets.Tau.dll</a>
fr: Ex. De <a href="https://github.com/naoei/tau">tau</a> : osu.Game.Rulesets.Tau.dll et le lien seront affichés comme <a href="https://github.com/naoei/tau/releases/latest/download/osu.Game.Rulesets.Tau.dll">https://github.com/naoei/tau/releases/latest/download/osu.Game.Rulesets.Tau.dll</a>

source: loved
fr: aimée

source: qualified
fr: qualifiée

source: approved
fr: approuvée

source: wip
fr: en construction

source: GitHub Repositories
fr: Dépôts GitHub
