Repository: HelloYeew/osu-ruleset-pages
Catalog: rurusetto/wiki/locale/*/LC_MESSAGES/django.po
Languages: fr, th

# add_recommend_beatmap_header
source: Recommend a new beatmap
fr: Recommander une nouvelle beatmap
th: แนะนำบีทแมพใหม่

source: You are currently add a new recommend beatmap for %(ruleset_name)s.
fr: Vous êtes actuellement en train de modifier le contenu du ruleset "%(ruleset_name)s".
th: คุณกำลังเพิ่มบีทแมพแนะนำสำหรับ %(ruleset_name)s

source: Beatmap ID
fr: Identifiant de la beatmap
th: ไอดีของบีทแมพ

# put_beatmap_id_note
source: Put the beatmap ID of the beatmap you want to recommend. You can find the beatmap ID from the URL of that beatmap.
fr: Mettez l'identifiant de la beatmap que vous voulez recommander. Vous pouvez trouver l'identifiant de la beatmap dans l'URL de la beatmap.
th: ใส่ไอดีของบีทแมพที่คุณต้องการแนะนำ คุณสามารถหาไอดีของบีทแมพได้จาก URL ของบีทแมพนั้นๆ

# put_beatmap_id_note2
source: Note that your beatmap must be for osu! mode only.
fr: Notez que votre beatmap doit uniquement être pour le mode osu!.
th: โดยที่บีทแมพนั้นต้องเป็นของโหมด osu! เท่านั้น

# put_beatmap_id_example
source: Example : Beatmap ID of "Harumachi Clover (Swing Arrangement) [Dictate Edit]" diffuculty "Oh no!" by Sotarks.
fr: Exemple : Identifiant de la beatmap "Harumachi Clover (Swing Arrangement) [Dictate Edit]" difficulté "Oh no!" par Sotarks.
th: ตัวอย่าง : ไอดีของบีทแมพ "Harumachi Clover (Swing Arrangement) [Dictate Edit]" ความยาก "Oh no!" โดย Sotarks.

# put_beatmap_id_example_pic_alt
source: How to get a beatmap ID
fr: Comment récupérer l'identifiant d'une beatmap
th: วิธีการหาไอดีของบีทแมพ

source: Comment
fr: Commenter
th: คอมเมนต์

# comment_note
source: Write a short comment about why you recommend this beatmap for this ruleset.
fr: Ecrivez un court commentaire à propos de pourquoi vous recommandez cette beatmap pour ce ruleset.
th: เขียนคอมเมนต์สั้นๆว่าทำไมคุณถึงแนะนำบีทแมพนี้สำหรับ ruleset นี้

source: Add
fr: Ajouter
th: เพิ่ม

# add_subpage_header
source: Add a new subpage
fr: Ajouter une sous-page
th: เพิ่มหน้าย่อยใหม่

source: Title
fr: Titre
th: หัวข้อ

# title_description
source: The subpage name.
fr: Le nom de la sous-page.
th: ชื่อของหน้าย่อยนี้

source: Subpage Content
fr: Contenu de la sous-page
th: เนื้อหาหน้าย่อย

source: Publication
th: การเผยเพร่

source: Hidden
fr: Masqué
th: ซ่อน

# subpage_hidden_note
source: If this is checked, your subpage will not be show in the subpage listing on other user.
fr: Si ceci est coché, votre sous-page ne sera pas affiché dans la liste de sous-pages des autres utilisateurs.
th: ถ้ากล่องนี้ถูกเช็ค หน้าย่อยหน้านี้ของคุณจะไม่ถูกแสดงในรายการหน้าย่อยของคนอื่น

source: Create
fr: Créer
th: สร้าง

source: Archived rulesets
fr: Rulesets archivés
th: rulesets ที่ถูกเก็บแล้ว

# archived_rulesets_description
source: The list of rulesets that's stop update or archived by rulesets creator.
fr: La liste des rulesets non mis à jours ou archivés par le créateur du ruleset.
th: รายการของ rulesets ที่หยุดอัพเดทหรือถูกเก็บโดยผู้สร้าง rulesets

source: Deleted User
fr: Utilisateur supprimé
th: User ที่ถูกลบ

source: Verified rulesets creator
fr: Créateur de ruleset vérifié
th: ผู้สร้าง rulesets ที่ได้รับการยืนยันแล้ว

source: Read
fr: Lire
th: อ่าน

source: Logo
th: โลโก้

source: Listing
fr: Liste
th: รายการ

source: Status
fr: Statut
th: สถานะ

source: Install
fr: Installer
th: ติดตั้ง

source: Changelog
fr: Journal de modifications
th: บันทึกการเปลี่ยนแปลง

source: Maintainer
fr: Mainteneur
th: ผู้ดูแล

source: Admin
fr: Administrateur
th: ผู้ดูแลระบบ

source: Settings
fr: Paramètres
th: ตั้งค่า

source: Profile
fr: Profil
th: โปรไฟล์

source: Sign out
fr: Se déconnecter
th: ออกจากระบบ

source: Sign in
fr: Se connecter
th: เข้าสู่ระบบ

source: Sign Up
fr: S'inscrire
th: สมัครบัญชี

source: Toggle Navigation
fr: Activer la navigation
th: เปิดเมนูนำทาง

source: Alert
fr: Alerte
th: แจ้งเตือน

# sign_out_notice
source: Are you sure you want to sign out :(
fr: Etes-vous sûr de vouloir vous déconnecter :(
th: คุณแน่ใจนะว่าจะลงชื่อออก :(

# sign_out_cancel
source: No,let me back!
fr: Non, laissez-moi revenir !
th: ไม่! นำฉันกลับไป

# made_with_love_by
source: Made with ❤️ by
fr: Fait avec ❤️ par
th: สร้างด้วย ❤️ โดย

source: and
fr: et
th: และ

# changelog_description
source: All update history of website are here.
fr: Tout l'historique de mise à jour du site web est ici :
th: ประวัติการอัพเดทของเว็ปไซต์อยู่ที่นี่

source: stable
th: เสถียร

source: Release at
fr: Publié le
th: ปล่อยเมื่อ

source: Add a new ruleset
fr: Ajouter un nouveau ruleset
th: เพิ่ม ruleset ใหม่

# add_a_new_ruleset_description
source: Let's add a new ruleset! Is it yours? Don't worry! You can add it even if you didn't make the ruleset.
fr: Ajoutons un nouveau ruleset ! Est-ce le vôtre ? Ne vous en faites pas ! Vous pouvez l'ajouter même si vous n'avez pas fait le ruleset.
th: มาเพิ่ม ruleset ใหม่กัน! นี่เป็นของคุณหรือเปล่า? ไม่ต้องห่วง! คุณสามารถเพิ่มมันแม้ว่าคุณจะไม่ได้สร้าง ruleset นั้นก็ได้

source: Header
fr: En-tête
th: หัวข้อ

source: Name
fr: Nom
th: ชื่อ

# name_description
source: The ruleset name.
fr: Nom du ruleset.
th: ชื่อของ ruleset

source: Description
th: คำบรรยาย

# description_description
source: The description of the ruleset. It will be visible under ruleset name and at the header of the wiki page.
fr: La description du ruleset. Elle sera visible sous le nom du ruleset et dans l'en-tête de la page wiki.
th: คำบรรยายสั้นๆสำหรับ ruleset คำบรรยายนี้จะถูกแสดงไว้ใต้ชื่อของ ruleset และที่หัวข้อของหน้าวิกิ

# icon_and_logo
source: Icon & Logo
fr: Icône & Logo
th: ไอคอน & โลโก้

source: Icon
fr: Icône
th: ไอคอน

# icon_description
source: An icon that shows on the in-game header. Recommend shape is a circle.
fr: Une icône qui apparaît dans l'en-tête en jeu. Un cercle est recommandé.
th: ไอคอนที่แสดงอยู่ในแถบข้างบนของเกม แนะนำให้รูปร่างของไอคอนเป็นวงกลม

source: Light icon
fr: Icône claire
th: ไอคอนในโหมดสว่าง

# light_icon_description
source: A light theme icon when user using website in light theme. Recommend shape is a circle.
fr: Un thème clair de l'icône pour les utilisateurs du site en mode clair. Un cercle est recommandé.
th: ไอคอนสำหรับใช้ในโหมดสว่างของเว็ปไซต์ แนะนำให้รูปร่างของไอคอนเป็นวงกลม

# logo_description
source: A logo that shows in the wiki's infobox. It cannot be the same as your icon.
fr: Un logo qui apparaît dans les informations du wiki. Elle ne peut pas être la même que votre icône.
th: โลโก้ที่แสดงในกล่องข้อมูลของวิกิ มันไม่จำเป็นจะต้องเหมือนไอคอนก็ได้

source: Wiki Content
fr: Contenu du wiki
th: เนื้อหาวิกิ

source: Wiki Styling
fr: Style du wiki
th: ตกแต่งหน้าวิกิ

source: Cover image
fr: Image de couverture
th: รูปปก

# cover_image_description
source: A picture at the header of the wiki page.
fr: Une image sur l'en-tête de la page wiki.
th: รูปที่แสดงอยู่หลังหัวข้อของวิกิ

source: Source
th: ที่มา

# source_description
source: A source of the ruleset (or where the player can download this ruleset.)
fr: Une source du ruleset (ou là où le joueur peut télécharger ce ruleset).
th: ที่มาของ ruleset (หรือที่ๆผู้เล่นคนอื่นๆสามารถไปโหลด ruleset นี้มาเล่นได้)

# source_description_github
source: If this ruleset is available on GitHub please link it to the repository (Ex. https://github.com/LumpBloom7/sentakki)
fr: Si ce ruleset est disponible sur GitHub, veuillez le lier au dépôt (Ex. https://github.com/LumpBloom7/sentakki)
th: ถ้า ruleset นี้อยู่บน GitHub กรุณาใส่เป็นลิงก์ของ repository (อย่างเช่น https://github.com/LumpBloom7/sentakki)

# source_description_patreon
source: If you found it on patreon, please link this to the patreon page of the creator. (Ex. https://www.patreon.com/evast/)
fr: Si vous l'avez trouvé sur patreon, veuillez lier ceci à la page patreon du créateur. (Ex. https://www.patreon.com/evast/)
th: ถ้าคุณเจอมันบน patreon กรุณาใส่เป็นลิงก์ไปที่หน้า patreon ของผู้สร้าง (อย่างเช่น https://www.patreon.com/evast/)

# hidden_description
source: If this is checked, your ruleset will not be show in the rulesets listing on other user.
fr: Si ceci est coché, votre ruleset ne sera pas affiché dans la liste de rulesets des autres joueurs.
th: ้ากล่องนี้ถูกเช็ค ruleset ของคุณจะไม่ถูกแสดงในรายการ ruleset ของคนอื่น

source: Edit
fr: Modifier
th: แก้ไข

source: You are currently editing content on ruleset named "%(ruleset_name)s".
fr: Vous êtes actuellement en train de modifier le contenu du ruleset "%(ruleset_name)s".
th: คุณกำลังแก้ไขเนื้อหาของ ruleset ที่ชื่อ "%(ruleset_name)s".

source: Current Icon
fr: Icône actuelle
th: ไอคอนตอนนี้

source: Current Light Icon
fr: Icône claire actuelle
th: ไอคอนในโหมดสว่างตอนนี้

source: Current Logo
fr: Logo actuel
th: โลโก้ตอนนี้

source: Current Cover Image
fr: Image de couverture actuelle
th: รูปปกตอนนี้

source: Cover Image in Light Mode
fr: Image de couverture en mode clair
th: รูปปกในโหมดสว่าง

source: Current Cover Image in Light Mode
fr: Image de couverture actuelle en mode clair
th: รูปปกในโหมดสว่างตอนนี้

# cover_image_in_light_mode_description
source: When user use light theme this picture will show on cover image instead of normal cover image.
fr: Quand l'utilisateur utilise le thème clair, cette image sera affichée dans l'image de couverture à la place de l'image de couverture normale
th: เมื่อผู้ใช้ใช้โหมดสว่างรูปนี้จะถูกแสดงเป็นรูปปกแทนรูปปกปกติ

source: Opengraph Preview Image
fr: Prévisualiation de l'image Opengraph
th: ภาพตัวอย่างใน Opengraph

source: Current Opengraph Preview Image
fr: Prévisualiation de l'image Opengraph actuelle
th: ภาพตัวอย่างใน Opengraph ตอนนี้

# opengraph_preview_image_description
source: A thumbnail that will be visible when someone shares the link and the social network app shows this picture as a preview image.
fr: Une miniature qui est visible lorsque quelqu'un partage le lien. Le réseau social affiche cette image comme image de prévisualisation.
th: รูปตัวอย่างที่จะแสดงเมื่อมีผู้ใช้แชร์ลิงก์ไปในแอป social network และ social network จะใช้รูปนี้เป็นรูปตัวอย่าง

source: Recommend Beatmaps Cover Image
fr: Image de couverture pour les beatmaps recommandées
th: รูปปกของหน้าแนะนำบีทแมพ

source: Current Recommend Beatmaps Cover Image
fr: Image de couverture actuelle pour les beatmaps recommandées
th: รูปปกของหน้าแนะนำบีทแมพตอนนี้

# recommend_beatmaps_cover_image_description
source: A cover image of the ruleset's recommend beatmaps page.
fr: Une image de couverture de la page des beatmaps recommandées pour le ruleset.
th: รูปปกของหน้าแนะนำบีทแมพของ ruleset นี้

source: Custom CSS
fr: CSS personnalisé
th: CSS ที่กำหนดเอง

source: Current Custom CSS
fr: CSS personnalisé actuel
th: CSS ที่กำหนดเองตอนนี้

# custom_css_description
source: This CSS file will be override the CSS of the website on the ruleset's main page and subpage.
fr: Ce fichier CSS écrasera le CSS du site web sur la page principale et la sous-page du ruleset.
th: CSS นี้จะไปทับ CSS ของหน้าวิกิและหน้าย่อยของ ruleset นี้

source: Download
fr: Télécharger
th: ดาวน์โหลด

source: Ruleset Filename
fr: Nom du fichier du ruleset
th: ชื่อไฟล์ ruleset

source: Ruleset owner settings
fr: Paramètres du propriétaire du ruleset
th: การตั้งค่าของเจ้าของ ruleset

# pre_release_description
source: If this is checked, the auto-update status system will fetch this ruleset as pre-release instead of normal method and on status page your rulesets will show pre-release badge too.
fr: Si ceci est coché, le système du statut de mise à jour automatique cherchera ce ruleset comme une pré-version au lieu d'une méthode normale, et sur la page de statut vos rulesets afficheront un badge de pré-version également.
th: ถ้ากล่องนี้ถูกเช็ค ระบบเช็คสถานะ ruleset อัตโนมัติจะดึงสถานะนของ ruleset นี้ในแบบ pre-release แทนการดึงปกติและในหน้าสถานะของ ruleset ป้าย pre-release จะถูกแสดงด้วย

source: Playable
fr: Jouable
th: เล่นได้

# playable_description
source: Your rulesets playable status. (This can change by wiki maintainer too if ruleset's playable status is not correct.)
fr: Le statut de jouabilité de votre ruleset. (Ceci peut aussi changer selon les mainteneurs du wiki si le statut de jouabilité du ruleset n'est pas correct.)
th: สถานะว่า ruleset ของคุณยังเล่นได้อยู่มั้ย (สถานะนี้สามารถเปลี่ยนโดยผู้ดูแลวิกิได้ถ้าสถานะนี้ไม่ถูกต้องตามจริง)

source: Edit Subpage
fr: Modifier la sous-page
th: แก้ไขหน้าย่อย

source: You are currently edit subpage "%(subpage_name)s" on ruleset name "%(ruleset_name)s".
fr: Vous modifiez actuellement la sous-page "%(subpage_name)s" sur le ruleset "%(ruleset_name)s".
th: คุณกำลังแก้ไขหน้าย่อย "%(subpage_name)s" ของ ruleset ที่ชื่อ "%(ruleset_name)s".

source: Submit
fr: Envoyer
th: ส่ง

source: Delete Subpage
fr: Supprimer la sous-page
th: ลบหน้าย่อย

# delete_subpage_description
source: Click the button below to delete this subpage. Note that this action cannot be undo!
fr: Cliquez sur le bouton ci-dessous pour supprimer cette sous-page. Notez que cette action est irréversible !
th: คลิกปุ่มข้างล่างนี้ถ้าคุณต้องการลบหน้าย่อยนี้ โปรดทราบว่าการดำเนินการนี้ไม่สามารถย่อนกลับได้นะ!

source: Delete This Subpage
fr: Supprimer cette sous-page
th: ลบหน้าย่อยนี้

# welcome_to_rurusetto
source: Welcome to rūrusetto!
fr: Bienvenue sur rūrusetto !
th: ยินดีต้อนรับเข้าสู่ rūrusetto!

# wiki_that_contain
source: A wiki that contain all osu! rulesets.
fr: Un wiki qui contient tous les rulesets osu!.
th: วิกิที่รวม rulesets ทุกอันของ osu!

source: Currently <code>DEBUG</code> settings in site settings is True. If this is live server please turn it off!
fr: Actuellement, le paramètre <code>DEBUG</code> dans les paramètres du site est activé. Si ceci est le serveur en ligne, veuillez le désactiver !
th: ตอนนี้การตั้งค่า <code>DEBUG</code> ในการตั้งค่าเว็ปไซต์เป็น True. ถ้านี่เป็นเซิฟเวอร์จริงกรุณาปิดด้วย!

source: You are currently in test server environment, please go to <a href="https://rulesets.info">live version</a> for a full experience.
fr: Vous êtes actuellement sur l'environnement du serveur de test, veuillez vous rendre à la <a href="https://rulesets.info">version en ligne</a> pour une expérience complète.
th: คุณกำลังอยู่ในเซิฟเวอร์ที่ใช้ทดสอบ, กรุณาไปที่ <a href="https://rulesets.info">เวอร์ชั่นทั่วไป</a> สำหรับประสบการณ์ที่เต็มที่

# install_and_update_rulesets
source: install and update the rulesets
fr: installer et mettre à jour les rulesets
th: ติดตั้งและอัพเดท rulesets

# install_and_update_rulesets_description
source: install and update the rulesets in osu!lazer with rūrusetto.
fr: installer et mettre à jour les rulesets dans osu!lazer avec rūrusetto.
th: ติดตั้งและอัพเดท rulesets ใน osu!lazer ด้วย rūrusetto

source: download rulesets file
fr: télécharger un fichier de ruleset
th: ดาวน์โหลดไฟล์ rulesets

source: Ruleset files can be obtained at <a class="text-decoration-none text-center spacing-hover-short hvr-icon-bounce" target="_blank" href="%(url_status)s"><i class="fas fa-info-circle icon-menu hvr-icon"></i> rulesets status page</a> and then clicking on the <code>Download latest version</code> on the desired ruleset.
fr: Les fichiers de rulesets peuvent être obtenus à la <a class="text-decoration-none text-center spacing-hover-short hvr-icon-bounce" target="_blank" href="%(url_status)s"><i class="fas fa-info-circle icon-menu hvr-icon"></i> page de statut des rulesets</a>, puis cliquez sur <code>Télécharger la dernière version</code> sur le ruleset souhaité.
th: ไฟล์ ruleset สามารถหาได้จาก <a class="text-decoration-none text-center spacing-hover-short hvr-icon-bounce" target="_blank" href="%(url_status)s"><i class="fas fa-info-circle icon-menu hvr-icon"></i> หน้าสถานะของ ruleset</a> และคลิกไปที่ <code>ดาวน์โหลดเวอร์ชั่นล่าสุด</code> บน ruleset ที่ต้องการได้เลย

source: The changelog and download link will automatically update when a ruleset is updated.
fr: Le journal de modifications et le lien de téléchargement se mettront automatiquement à jour lorsqu'un ruleset sera mis à jour.
th: บันทึกการเปลี่ยนแปลงและลิงก์ดาวน์โหลดจะอัพเดทอัตโนมัติเมื่่ ruleset ได้รับการอัพเดท

source: import rulesets to osu!lazer
fr: importer des rulesets dans osu!lazer
th: นำ rulesets เข้าใน osu!lazer

source: step 1: navigate to osu! data directory
fr: étape 1 : allez dans votre dossier contenant les données d'osu!
th: ขั้นตอนที่ 1: ไปที่โฟลเดอร์ข้อมูลของ osu!

source: In osu!lazer’s setting panel, there is a button to <code>Open osu! folder</code> within the “General” section. On windows you could navigate to the data folder directly via Windows Explorer, by default this location is <code>%%AppData%%/osu!/rulesets</code>. On MacOS default this location is in application itself.
th: ในแผงหน้าการตั้งค่าจะมีปุ่มเพื่อไปที่ <code>Open osu! folder (เปิดโฟลเดอร์ osu!)</code> ภายในส่วน “General (ทั่วไป)” ใน windows คุณสามารถไปที่โฟล์เดอร์ข้อมูล ได้โดยตรงผ่าน Windows Explorer ปกติที่อยู่ของโฟลเดอร์นี้จะอยู่ที่ <code>%%AppData%%/osu!/rulesets</code>. ใน MacOS โฟลเดอร์นี้จะอยู่ที่ภายในแอป

source: Open osu! folder
fr: Ouvrez le dossier osu!
th: เปิดโฟลเดอร์ osu!

source: Move rulesets file
fr: Déplacez le fichier de ruleset
th: ย้ายไฟล์ rulesets

source: step 2: installing the ruleset
fr: étape 2 : installer le ruleset
th: ขั้นตอนที่ 2: ติดตั้ง ruleset

source: Copy the ruleset file (.dll file that you just downloaded) into the rulesets directory, do make sure that duplicate copies of the ruleset are overwritten.
fr: Copiez le fichier de ruleset (le .dll que vous venez juste de télécharger) dans le dossier de rulesets, assurez-vous que les doublons du ruleset soient écrasées.
th: คัดลอกไฟล์ ruleset (ไฟล์ .dll ที่คุณเพิ่งดาวน์โหลดมา) ไปในโฟลเดอร์ที่ชื่อว่า rulesets ตรวจสอบให้มั่นใจด้วยว่าไฟล์ ruleset ที่ซ้ำกันถูกเขียนทับแล้ว

source: Other rulesets also could share the same folder.
fr: D'autres rulesets peuvent également partager le même dossier.
th: rulesets อื่นสามารถใช้โฟลเดอร์เดียวกันได้

source: step 3: have fun!
fr: étape 3 : amusez-vous !
th: ขั้นตอนที่ 3: เล่นให้สนุก!

source: After completing the above steps, you may need to restart osu!lazer if it is already open. Once restarted, you should see the ruleset alongside the standard rulesets.
fr: Après avoir terminé les étapes ci-dessus, il se peut que vous deviez redémarrer osu!lazer s'il est déjà ouvert. Une fois redémarré, vous devriez voir le ruleset parmi les rulesets standard.
th: หลังจากเสร็จทุกขั้นตอนแล้วคุณอาจจะต้องปิดและเปิด osu!lazer ใหม่ถ้ามันเปิดอยู่แล้วหลังจากที่ปิดและเปิดใหม่แล้วคุณจะเห็น ruleset ใหม่อยู่ข้างๆ ruleset มาตรฐาน

# rulesets_show_in_lazer_toolbar
source: Rulesets show in lazer's toolbar
fr: Les rulesets sont affichés dans la barre d'outils d'osu!lazer
th: rulesets ในแถบเครื่องมือของ lazer

source: update rulesets
fr: mettre à jour des rulesets
th: อัพเดท rulesets

source: To update rulesets, just do the same step and overwrite the old rulesets file.
fr: Pour mettre à jour des rulesets, recommencez les étapes précédentes et écrasez l'ancien fichier de ruleset.
th: ในการอัพเดท rulesets เพียงแค่ทำขั้นตอนเดิมและเขียนทับไฟล์ rulesets เก่า

# listing_description
source: List of available rulesets.
fr: Liste des rulesets disponibles.
th: รายการของ rulesets ที่มีอยู่

source: Your hidden rulesets
fr: Vos rulesets masqués
th: Ruleset ที่คุณซ่อนไว้อยู่

source: All rulesets
fr: Tous les rulesets
th: Ruleset ทุกอัน

source: Maintainer Menu
fr: Menu du mainteneur
th: เมนูผู้ดูแล

# maintainer_menu_description
source: Menu for maintainer only!
fr: Un menu uniquement pour le mainteneur !
th: เมนูสำหรับผู้ดูแลเท่านั้น

# run_action_for_maintainer
source: Run an action only for maintainer
fr: Réaliser une action uniquement pour le mainteneur
th: เริ่ม action สำหรับผู้ดูแล

source: Warning
fr: Attention
th: ระวัง

# action_warning
source: This action is running in background and consume a lot of calculation power. Please use it carefully!
fr: Cette action fonctionne en arrière-plan et consomme énormément de puissance de calcul. Utilisez-la avec précaution !
th: action นี้จะวิ่งอยู่พื้นหลังและใช้พลังในการคำนวณสูงมาก กรุณาใช้อย่างระมัดระวังด้วย!

source: Update all beatmaps metadata
fr: Mettre à jour les métadonnées de toutes les beatmaps
th: อัพเดทข้อมูลของบีทแมพทั้งหมด

# update_all_beatmaps_metadata_description
source: Update all beatmap metadata in the server.
fr: Mettre à jour les métadonnées de toutes les beatmaps dans le serveur
th: อัพเดทข้อมูลของบีทแมพในเซิฟเวอร์ทั้งหมด

source: Update rulesets version
fr: Mettre à jour les versions des rulesets
th: อัพเดทเวอร์ชั่นของ rulesets

# update_rulesets_version_description
source: This is a long task that must be always run. It will fetch the data from GitHub API and update the ruleset version from on status page every 30 minutes. Please check on other worker before run this due to the rate limit of GitHub API.
fr: Ceci est une longue tâche qui doit toujours être exécutée. Elle récupèrera les données de l'API GitHub et mettra à jour les versions des rulesets sur la page de statut toutes les 30 minutes. Vérifiez auprès des autres contributeurs avant de lancer ceci à cause de la limite de requêtes de l'API GitHub.
th: นี่เป็น action ที่วิ่งยาวๆและต้องปล่อยให้มันวิ่งเสมอ มันจะดึงข้อมูลจาก GitHub API และอัพเดทเวอร์ชั่นของ ruleset บนหน้าสถานะทุกๆ 30 นาที กรุณาเช็คงานอื่นๆก่อนเริ่ม action นี้เพราะ rate limit ของ GitHub API

source: Update rulesets version once
fr: Mettre à jour les versions des rulesets une seule fois
th: อัพเดทเวอร์ชั่นของ rulesets ครั้งเดียว

# update_rulesets_version_once_description
source: This action will be quickly update all rulesets version. This can be run when something happen or don't want to use the long task.
fr: Cette action mettra rapidement à jour toutes les versions des rulesets. Ceci peut être utilisé lorsque quelque chose est déjà en exécution ou lorsqu'on ne veut pas utiliser la longue tâche.
th: action นี้จะอัพเดทเวอร์ชั่นของ ruleset อย่างรวดเร็ว action นี้สามารถเริ่มได้เมื่อบางสิ่งบางอย่างผิดปกติหรือไม่อยางเริ่ม action ที่วิ่งยาวๆ

source: Start at
fr: Démarré à
th: เริ่มเมื่อ

source: Duration
fr: Durée
th: ระยะเวลา

source: Calculating
fr: En calcul
th: คำนวณอยู่

source: Idle
fr: Inactif
th: ว่าง

source: Loading
fr: En chargement
th: กำลังโหลด

source: Successfully running
fr: S'exécute avec succès
th: งานสำเร็จ

source: Run failed
fr: Exécution échouée
th: งานล้มเหลว

source: Running status
fr: Statut d'exécution
th: สถานะงาน

source: Running
fr: En cours d'exécution
th: กำลังทำงาน

source: Unknown status
fr: Statut inconnu
th: ไม่รู้สถานะ

source: %(ruleset_name)s recommended beatmaps
fr: Beatmaps recommandées de %(ruleset_name)s
th: บีทแมปแนะนำของ %(ruleset_name)s

source: Recommend beatmaps for playing with %(ruleset_name)s from ruleset creator and other player.
fr: Recommander des beatmaps pour jouer avec %(ruleset_name)s du créateur du ruleset et d'autres joueurs
th: บีทแมปแนะนำสำหรับเล่นกับ %(ruleset_name)s โดยผู้สร้าง ruleset และผู้เล่นคนอื่นๆ

source: Back to main page
fr: Revenir à la page principale
th: กลับไปที่หน้าหลัก

source: Add a recommend beatmap
fr: Ajouter une beatmap recommandée
th: เพิ่มบีทแมปแนะนำ

source: Approve pending beatmap
fr: Approuver une beatmap en attente
th: อนุมัติบีทแมปที่รอการยืนยัน

source: Suggest a beatmap
fr: Suggérer une beatmap
th: แนะนำบีทแมปใหม่

source: Recommended by %(ruleset_name)s creator
fr: Recommandé par le créateur de %(ruleset_name)s
th: แนะนำโดยผู้สร้าง %(ruleset_name)s

# recommend_by_players
source: Recommended by players
fr: Recommandé par les joueurs
th: แนะนำโดยผู้เล่น

# no_recommend_beatmap
source: No recommended beatmaps added for this ruleset.
fr: Aucune beatmap recommandé pour ce ruleset.
th: ไม่มีบีทแมปแนะนำ

source: Let's add one!
fr: Ajoutons-en une !
th: มาเพิ่มกัน!

source: %(ruleset_name)s recommended beatmaps approval
fr: Approbation des beatmaps recommandées de %(ruleset_name)s
th: อนุมัติบีทแมปที่รอการยืนยันของ %(ruleset_name)s

# recommend_beatmaps_approval_description
source: Let's see how is the recommendation from other player.
fr: Voyons les recommandations des autres joueurs.
th: มาดูกันว่าผู้เล่นคนอื่นๆแนะนำอะไรกันมาบ้าง
