Repository: HelloYeew/osu-ruleset-pages
Catalog: rurusetto/users/locale/*/LC_MESSAGES/django.po
Languages: th

source: Log In
th: เข้าสู่ระบบ

# login_to_rurusetto
source: login to rūrusetto
th: เข้าสู่ระบบ rūrusetto

source: Log in with
th: เข้าสู่ระบบด้วย

source: Submit
th: ส่ง

# no_account
source: Don't have an account?
th: ไม่มีบัญชี?

source: Sign Up
th: สมัครบัญชี

source: register
th: สมัครบัญชี

# register_to_rurusetto
source: register to rūrusetto world
th: สมัครบัญชี rūrusetto

source: Sign up with
th: สมัครด้วย

# already_have_account
source: Already have an account?
th: มีบัญชีอยู่แล้ว?

source: Login instead
th: เข้าสู่ระบบแทน

source: Login Failed
th: เข้าสู่ระบบไม่สำเร็จ

# login_failed_description
source: failed to login to rūrusetto
th: เข้าสู่ระบบ rūrusetto ไม่สำเร็จ

# error_while_login_osu
source: An error occurred while attempting to login via your osu! account.
th: เกิดข้อผิดพลาดขึ้นระหว่างกำลังเข้าสู่ระบบด้วยบัญชี osu! ของคุณ

# back_to_login
source: Back to login page
th: กลับไปที่หน้าเข้าสู่ระบบ

source: Return to homepage
th: กลับไปที่หน้าหลัก

source: account connection
th: การเชื่อมต่อบัญชี

# account_connection_description
source: connect rūrusetto account with osu! account
th: เชื่อมต่อบัญชี rūrusetto ด้วยบัญชี osu!

source: Connection status
th: สถานะการเชื่อมต่อ

source: Unknown status
th: ไม่รู้สถานะ

source: No status provided
th: ไม่มีสถานะ

# back_to_setting_page
source: Back to settings page
th: กลับไปที่หน้าตั้งค่า

source: Connect %(provider)s
th: เชื่อมต่อ %(provider)s

source: You are about to connect a new account from %(provider)s.
th: คุณกำลังจะเชื่อมต่อบัญชีใหม่จาก %(provider)s

source: Sign in via %(provider)s
th: เข้าสู่ระบบด้วย %(provider)s

source: You are about to sign in using account from %(provider)s.
th: คุถกำลังจะเข้าสู้ระบบด้วยบัญชีจาก %(provider)s

source: Continue
th: ไปต่อ

# no_dont_want
source: No, I don't want!
th: ไม่! ไม่ต้องการ

source: Go back!
th: กลับไป!

source: login cancelled
th: ยกเลิกการเข้าสู่ระบบ

# login_cancelled_description
source: login cancelled by user
th: ยกเลิกการเข้าสู่ระบบโดยผู้ใช้

source: You decided to cancel logging in to rūrusetto using your osu! account. If this was a mistake, please <a class="text-decoration-none spacing-hover" href="%(login_url)s">sign in again</a>.
th: คุณตัดสินใจที่จะยกเลิกการเข้าสู้ระบบ rūrusetto ด้วยบัญชี osu! ของคุณ ถ้านี่เป็นข้อผิดพลาด กรุณา <a class="text-decoration-none spacing-hover" href="%(login_url)s">เข้าสู่ระบบใหม่</a>.

source: Connect to
th: เชื่อมต่อกับ

source: Delete Account
th: ลบบัญชี

# delete_account_description
source: this is danger page!
th: นี่เป็นหน้าอันตราย!

# delete_account_confirmations
source: Are you sure you want to delete your account? All of your info will be deleted. You cannot undo this action!
th: คุณมั่นใจหรือไม่ว่าจะลบบัญชีของคุณ? ข้อมูลของคุณทุกอย่างจะถูกลบ คุณไม่สามารถย้อนกลับการกระทำนี้ได้นะ!

source: Return to settings
th: กลับไปหน้าตั้งค่า

source: Edit Profile
th: แก้ไขโปรไฟล์

# created_ruleset
source: created rulesets
th: ruleset ที่สร้าง

source: Deleted User
th: User ที่ถูกลบ

source: Read
th: อ่าน

source: Settings
th: ตั้งค่า

# settings_description
source: All profile and website settings are visible here!
th: การตั้งค่าโปรไฟล์และเว็ปไซต์ทั้งหมดอยู่ที่นี่!

source: Main Menu
th: เมนูหลัก

source: Profile
th: โปรไฟล์

source: Configuration
th: การกำหนดค่า

source: Account
th: บัญชี

source: Creator
th: ผู้สร้าง

source: Profile Sync
th: การซิงค์โปรไฟล์

source: Update profile every login session
th: อัพเดทโปรไฟล์ทุกๆการเข้าสู่ระบบ

# update_profile_every_login_session_description
source: If this is checked, the system will update your profile to make it the same as your osu! profile everytime time you login (Your profile setting will be disabled).
th: ถ้ากล่องนี้ถูกเช็ค ระบบจะอัพเดทโปรไฟล์ของคุณให้เหมือนในโปรไฟล์ osu! ทุกครั้งที่คุณเข้าสู่ระบบ (การตั้งค่าโปรไฟบ์ของคุณจะถูกปิด)

source: User Information
th: ข้อมูลผู้ใช้

source: Username
th: ชื่อผู้ใช้

source: Email
th: อีเมลล์

source: User information is handled by the system. If you want to customize your profile, please uncheck the <i>Update Profile Every Login Session</i> setting.
th: ข้อมูลผู้ใช้ของคุณกำลังถูกจัดการโดยระบบอยู่ ถ้าคุณอยากแก้ไข้โปรไฟล์ของคุณกรุณาไม่เช็คในกล่องการตั้งค่า <i>อัพเดทโปรไฟล์ทุกๆการเข้าสู่ระบบ</i>

source: Profile Page Detail
th: รายละเอียดหน้าโปรไฟล์

source: Profile picture
th: รูปโปรไฟล์

source: Current Profile Picture
th: รูปโปรไฟล์ตอนนี้

source: Profile page cover image
th: รูปปกในหน้าโปรไฟล์

source: Current Cover Image
th: รูปปกตอนนี้

# profile_page_cover_image_light_mode
source: Profile page cover image in light mode
th: รูปปกในหน้าโปรไฟล์ในโหมดสว่าง

source: Current Light Mode Cover Image
th: รูปปกในหน้าโปรไฟล์ในโหมดสว่างตอนนี้

source: About Me
th: เกี่ยวกับฉัน

source: osu! username
th: ชื่อผู้ใช้งาน osu!

source: Profile page details are handled by the system. If you want to customize your profile, please uncheck the <i>Update Profile Every Login Session</i> setting.
th: ข้อมูลหน้าโปรไฟล์ของคุณกำลังถูกจัดการโดยระบบอยู่ ถ้าคุณอยากแก้ไข้โปรไฟล์ของคุณกรุณาไม่เช็คในกล่องการตั้งค่า <i>อัพเดทโปรไฟล์ทุกๆการเข้าสู่ระบบ</i>

source: Profile Page Display Settings
th: การตั้งค่าการแสดงผลหน้าโปรไฟล์

source: Hide Email
th: ซ่อนอีเมลล์

# hide_email_description
source: If checked, your email will not be visible on your profile page.
th: ถ้ากล่องนี้ถูกเช็ค อีเมลล์ของคุณจะไม่แสดงในหน้าโปรไฟล์ของคุณ

source: Website Configuration
th: การกำหนดค่าเว็ปไซต์

source: Website Theme
th: ธีมเว็ปไซต์

source: Appearance
th: โหมด

source: Wiki Page Display
th: การแสดงผลหน้าวิกิ

source: Subpage Index
th: สารบัญหน้าย่อย

# subpage_index_description
source: Appearance settings of the subpage menu at the top of the rulesets page.
th: การตั้งค่าการแสดงผลของเมนูหน้าย่อยในวิกิที่แสดงผลอยู่บนสุดของหน้าวิกิ

source: Rulesets Creator Settings
th: การตั้งค่าของผู้สร้าง rulesets

# rulesets_creator_settings_description
source: These settings will only be visible when you are one of the rulesets creator in the wiki.
th: การตั้งค่านี้จะเห็นเมื่อคุณเป็นหนึ่งในผู้สร้าง rulesets ในวิกินี้

source: Support
th: สนับสนุน

source: These are the settings of the detail in <code>Support the creator</code> modal so other players who love your rulesets can support you. If you don't want to use this function please leave all fields blank.
th: นี่เป็นการตั้งค่าในโมดอล <code>สนับสนุนผู้สร้าง</code> ผู้เล่นที่ชื่นชอบ rulesets ของคุณจะสามารถสนับสนุนคุณได้ ถ้าคุณไม่ต้องการใช้ฟังก์ชั่นนี้กรุณาปล่อยให้ทุกช่องว่าง

source: Support Message
th: ข้อความสนับสนุน

# support_message_description
source: Your message to the visitor.
th: ข้อความถึงผู้เยี่ยมชม

source: Patreon Link
th: ลิงก์ Patreon

# patreon_link_description
source: Link to your Patreon page. (Leave blank if you don't have a Patreon account)
th: ลิงก์ไปที่หน้า Patreon ของคุณ (ปล่อยว่างถ้าคุณไม่มีบัญชี Patreon)

source: Ko-fi Link
th: ลิงก์ Ko-fi

# kofi_link_description
source: Link to your Ko-fi page so users can buy you coffee! (Leave blank if you don't have a Ko-Fi account)
th: ลิงก์ไปที่หน้า Ko-fi ของคุณผู้ใช้คนอื่นๆจะได้ซื้อกาแฟให้คุณได้! (ปล่อยว่างถ้าคุณไม่มีบัญชี Ko-fi)

source: GitHub Sponsors Link
th: ลิงก์ GitHub Sponsors

# github_sponsors_link_description
source: Link to your GitHub Sponsors page. (Leave blank if you don't have a sponsors page)
th: ลิงก์ไปที่หน้า GitHub Sponsors ของคุณ (ปล่อยว่างถ้าคุณไม่มีหน้า sponsors)

source: account_connection_settings
th: การตั้งค่าการเชื่อมต่อบัญชี

source: account_connection_settings_description
th: คุณสามารถเชื่อมต่อบัญชีของคุณกับบัญชี osu! ได้คุณจะได้เข้าสู่ระบบได้โดยใช้บัญชี osu! แทนที่จะใช้ขื่อผู้ใช้งานและรหัสผ่านของ Rūrusetto

# already_connected_message
source: This account is connected to osu! account with username
th: บัญชีนี้ถูกเชื่อมต่อกับบัญชี osu! แล้วด้วยบัญชี

source: Delete Account Process
th: กระบวนการลบบัญชี
